/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

//
// Form : Lpss Scc configuration
//
//
// SCC Configuration
//
#string STR_SCC_OPTIONS_FORM_TITLE                     #language en-US "SCC Configuration"
#string STR_SCC_OPTIONS_FORM_HELP                      #language en-US "SCC Configuration Settings"
#string STR_SCC_EMMC_PROMPT                            #language en-US "SCC eMMC Support (D16:F0)"
#string STR_SCC_EMMC_HELP                              #language en-US "Enable/Disable SCC eMMC Support"
#string STR_SCC_EMMC_HS400_PROMPT                      #language en-US "eMMC 5.0 HS400 Mode"
#string STR_SCC_EMMC_HS400_HELP                        #language en-US "Enable or Disable SCC eMMC 5.0 HS400 Mode"
#string STR_SCC_SDIO_PROMPT                            #language en-US "SCC SDIO Support (D17:F0)"
#string STR_SCC_SDIO_HELP                              #language en-US "Enable/Disable SCC SDIO Support"
#string STR_SCC_SDCARD_PROMPT                          #language en-US "SCC SD Card Support (D18:F0)"
#string STR_SCC_SDCARD_HELP                            #language en-US "Enable/Disable SCC SD Card Support"

#string STR_EMMC_DRIVER_MODE_PROMPT                    #language en-US " eMMC Driver Operating Mode"
#string STR_EMMC_DRIVER_MODE_HELP                      #language en-US "Selects the operating frequency in eMMC Driver"
#string STR_EMMC_DRIVER_MODE_AUTO                      #language en-US "Auto Detect"
#string STR_EMMC_DRIVER_MODE_52MHZ                     #language en-US "Up to 52 MHz"
#string STR_EMMC_DRIVER_MODE_26MHZ                     #language en-US "Up to 26 MHz"
#string STR_EMMC_DRIVER_MODE_BASIC                     #language en-US "Basic Frequency"

#string STR_EMMC_RX_TUNING_ENABLE_PROMPT               #language en-US " eMMC RX DLL Tuning Support"
#string STR_EMMC_RX_TUNING_ENABLE_HELP                 #language en-US " Enable/Disable eMMC RX DLL Tuning Support"

#string STR_EMMC_TX_TUNING_ENABLE_PROMPT               #language en-US " eMMC TX DLL Tuning Support"
#string STR_EMMC_TX_TUNING_ENABLE_HELP                 #language en-US " Enable/Disable eMMC TX DLL Tuning Support"

#string STR_SCC_SDIO_MODE_PROMPT                       #language en-US  "SCC SDIO Mode for WIFI"
#string STR_SCC_SDIO_MODE_HELP                         #language en-US  "Select SDIO mode for WIFI, only for A0/A1 stepping."
#string STR_SDIO_DEFAULT_MODE                          #language en-US  "Default"
#string STR_SDIO_DDR50_MODE                            #language en-US  "DDR50"
